# Pandas 
- it is python library which provides functionalities  to work with analysing and manupulating of the data
- pandas is open source built on top of numpy
- popular for analysing the data in easier way

# why pandas 
1. the data sent to machine learning model that will be in rows and column format i.e
in table format
2. pandas provide us functionalities in order to analyse rows and columns of data
3. helps us in performing the statitical analysis on the data
4. it can analyse huge data.
5. helps us in cleaning the data

### what pandas can create
1. Series
2. Dataframe

In [2]:
# one dimensional data structure in form of row     -  Array
# one dimensional data structure in form of column  -  Series

# Series

Series is 1D array holding data of any dtype ,in the column format
Series in pandas like column in table

In [4]:
import numpy as np
import pandas as pd

In [5]:
s = pd.Series()
print(s)

Series([], dtype: object)

In [9]:
s1 = pd.Series(['a', 'b' ,'c'])
print(s1)

0    a
1    b
2    c
dtype: object

dtype('O')

In [12]:
s2 = pd.Series((1,2,3,4,5))
s2

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [13]:
# create a series using list
l = [1,2,4,5,6]
s3 = pd.Series(l)
print(s3)

0    1
1    2
2    4
3    5
4    6
dtype: int64

In [14]:
t = (1,2,3)
s4 = pd.Series(t)
s4

0    1
1    2
2    3
dtype: int64

In [18]:
# create a series using the dictionary
d  = {1:'a' , 2 :'b' ,3 :'c'}
s5 = pd.Series(d)
s5

1    a
2    b
3    c
dtype: object

In [21]:
d  = {1:'a' , 2 :'b' ,3 :'c'}
s5 = pd.Series(d , name = 'albhabate' ,)
s5

1      a
3      c
4    NaN
Name: albhabate, dtype: object

In [22]:
d = {1:'latha' ,2 :'achar' ,3: 'Btech' ,4:'Bengaluru'}
s6 = pd.Series(d)
s6

1        latha
2        achar
3        Btech
4    Bengaluru
dtype: object

In [25]:
s7 = (11,12,14,15,16)
pd.Series(s7 , index = [1,2, 3, 4,5 ] , dtype = 'float')

1    11.0
2    12.0
3    14.0
4    15.0
5    16.0
dtype: float64

In [26]:
s8 = pd.Series([1.0, 2.0 ,3.0])
s8

0    1.0
1    2.0
2    3.0
dtype: float64

In [28]:
s8.index = [1,2,3]
s8

1    1.0
2    2.0
3    3.0
dtype: float64

In [32]:
a = np.array(['one' ,'two' ,'three' ,'four' ,'five'])
s9 = pd.Series(a , index = [1,2,4,3 ,5] ,name= 'number')
s9

1      one
2      two
4    three
3     four
5     five
Name: number, dtype: object

### accesing the observations from series

In [37]:
s9[3]

'four'

In [41]:
s9[5]

'five'

In [42]:
s9[1:3]

2      two
4    three
Name: number, dtype: object

In [38]:
s9[0:2]

1    one
2    two
Name: number, dtype: object

In [43]:
s9[1] = 10

In [46]:
s9

1       10
2      two
4    three
3     four
5     five
Name: number, dtype: object

In [47]:
s9[2:5]

4    three
3     four
5     five
Name: number, dtype: object

In [44]:
s9

1       10
2      two
4    three
3     four
5     five
Name: number, dtype: object

In [50]:
s9[1:3] = [20 ,30]

In [51]:
s9

1      10
2      20
4      30
3    four
5    five
Name: number, dtype: object

# Disadvantages of Series
-series does not have column name , which is very irrelevent 
- without column name there is no much meaning for the data which is stored
-  Hence giving such data for the model to learn is not benificial /not valid for    the model
- therefore , we shifted to new data structure called Dataframe

### DataFrame
- is a 2D data structure i.e. information is stored in the form of rows and columns
- usually call it as table
- any data which is stored as dataframe / table is a ready data for the model to learn

### properties 
1. all the column have name and corresponding values will be stored in row
2. all the column will have its own data type and hold homogenous data
3. easy to access columns and rows and do manupulate on it

In [172]:
l1 = [[1,2,3,4]  ]
pd.DataFrame(l , columns  =   ['a' ,'b' ,'c' ,'d'])

   a  b  c  d
0  1  2  3  4

In [ ]:
l2 = pd.DataFrame([])

In [171]:
# syntax : pd.DataFrame(data ,column)
l = [[1,2] ,[3,4]]
d  = pd.DataFrame(l)
d

   0  1
0  1  2
1  3  4

In [54]:
df1 = pd.DataFrame( l , columns = ['first' ,'second'])

In [55]:
df1

   first  second
0      1       2
1      3       4

In [58]:
df2 = pd.DataFrame( l , columns = ['first' ,'second'],index = [1,2])
df2

   first  second
1      1       2
2      3       4

In [60]:
l1 = [['john' ,24] ,['lakshmi' ,24] ,['marry' ,24]]
df2 = pd.DataFrame(l1, columns = ['name' ,'age'])
df2

      name  age
0     john   24
1  lakshmi   24
2    marry   24

In [63]:
l2 = [['apple' ,1,100] ,['orange' ,1]]
df3 = pd.DataFrame(l2 , columns = ['Fruit' , 'kilo'  ,'cost'])
df3

    Fruit  kilo   cost
0   apple     1  100.0
1  orange     1    NaN

In [65]:
l2 = [['apple' ,1,100] ,['orange' ,1]]
df3 = pd.DataFrame(l2 , columns = ['Fruit' , 'kilo'  ,'cost' ])
df3

    Fruit  kilo   cost
0   apple     1  100.0
1  orange     1    NaN

In [152]:
# dictionary 
d = {'Name' : ('Lakshmi' ,'john' ,'mary' ,'ABC' ,'XYZ'),'age': [24,25,24,27,27],
    'domain' : ['SME' ,'DS' ,'DA' ,'DE','AI'],
    'salary' :[30000 ,35000 ,40000 ,45000 ,50000]}
d

{'Name': ('Lakshmi', 'john', 'mary', 'ABC', 'XYZ'),
 'age': [24, 25, 24, 27, 27],
 'domain': ['SME', 'DS', 'DA', 'DE', 'AI'],
 'salary': [30000, 35000, 40000, 45000, 50000]}

In [175]:
Name = ('Lakshmi' ,'john' ,'mary' ,'ABC' ,'XYZ')
age  =  [24,25,24,27,27]
domain =  ['SME' ,'DS' ,'DA' ,'DE','AI']
pd.DataFrame([Name , age , domain])

         0     1     2    3    4
0  Lakshmi  john  mary  ABC  XYZ
1       24    25    24   27   27
2      SME    DS    DA   DE   AI

In [153]:
data = pd.DataFrame(d ,index = [1,2,3,4,5])
data

      Name  age domain  salary
1  Lakshmi   24    SME   30000
2     john   25     DS   35000
3     mary   24     DA   40000
4      ABC   27     DE   45000
5      XYZ   27     AI   50000

In [76]:
data.set_index = [1,2,3,4,5]
data

      Name  age domain  salary
1  Lakshmi   24    SME   30000
2     john   25     DS   35000
3     mary   24     DA   40000
4      ABC   27     DE   45000
5      XYZ   27     AI   50000

In [80]:
data.sort_values('age' )

      Name  age domain  salary
1  Lakshmi   24    SME   30000
3     mary   24     DA   40000
2     john   25     DS   35000
4      ABC   27     DE   45000
5      XYZ   27     AI   50000

In [81]:
data.sort_index()

      Name  age domain  salary
1  Lakshmi   24    SME   30000
2     john   25     DS   35000
3     mary   24     DA   40000
4      ABC   27     DE   45000
5      XYZ   27     AI   50000

In [82]:
data.sort_index(ascending = False)

      Name  age domain  salary
5      XYZ   27     AI   50000
4      ABC   27     DE   45000
3     mary   24     DA   40000
2     john   25     DS   35000
1  Lakshmi   24    SME   30000

In [ ]:
# inplace = True 
# this parameter will apply the change permenantly

In [86]:
data.sort_values('age' , inplace = True)
data

      Name  age domain  salary
1  Lakshmi   24    SME   30000
3     mary   24     DA   40000
2     john   25     DS   35000
4      ABC   27     DE   45000
5      XYZ   27     AI   50000

In [95]:
# how to retrive the elements from the data
# loc and iloc

# loc - location 

# iloc - index location - we make use of index number of row index and column index

In [96]:
data.loc[: ,['Name' ]]

      Name
1  Lakshmi
2     mary
3     john
4      ABC
5      XYZ

In [97]:
data.loc[: ,['Name' , 'age' ]]

      Name  age
1  Lakshmi   24
2     mary   24
3     john   25
4      ABC   27
5      XYZ   27

In [98]:
data.index = [2,3,4,5,6]

In [99]:
data.index = [1,2,3,4,5]
data

      Name  age domain  salary
1  Lakshmi   24    SME   30000
2     mary   24     DA   40000
3     john   25     DS   35000
4      ABC   27     DE   45000
5      XYZ   27     AI   50000

In [101]:
# fetch the 1st row and all the column

In [102]:
data.loc[[1] ,:]

      Name  age domain  salary
1  Lakshmi   24    SME   30000

In [103]:
data.loc[[1,2] ,:]

      Name  age domain  salary
1  Lakshmi   24    SME   30000
2     mary   24     DA   40000

In [109]:
data.loc[[1,2], ['Name' ,'age']]

      Name  age
1  Lakshmi   24
2     mary   24

In [110]:
data.loc[[3,5] ,['salary']]

   salary
3   35000
5   50000

In [111]:
data.loc[: , ['salary']]

   salary
1   30000
2   40000
3   35000
4   45000
5   50000

In [112]:
data['Name']

1    Lakshmi
2       mary
3       john
4        ABC
5        XYZ
Name: Name, dtype: object

In [113]:
data.Name

1    Lakshmi
2       mary
3       john
4        ABC
5        XYZ
Name: Name, dtype: object

In [116]:
data[['age' ,'Name']]

   age     Name
1   24  Lakshmi
2   24     mary
3   25     john
4   27      ABC
5   27      XYZ

In [122]:
data[data.age>25]

  Name  age domain  salary
4  ABC   27     DE   45000
5  XYZ   27     AI   50000

In [123]:
data.loc[data.age>25]

  Name  age domain  salary
4  ABC   27     DE   45000
5  XYZ   27     AI   50000

In [125]:
data.loc[data.domain == 'DA']

   Name  age domain  salary
2  mary   24     DA   40000

In [129]:
data.loc[(data.domain == 'DA') & (data.age>25)]

Empty DataFrame
Columns: [Name, age, domain, salary]
Index: []

In [131]:
data.loc[(data.domain == 'DA') | (data.age>25)]

   Name  age domain  salary
2  mary   24     DA   40000
4   ABC   27     DE   45000
5   XYZ   27     AI   50000

In [132]:
data.loc[data.age.between(20,24)]

      Name  age domain  salary
1  Lakshmi   24    SME   30000
2     mary   24     DA   40000

In [136]:
data.loc[data.age != 27]

      Name  age domain  salary
1  Lakshmi   24    SME   30000
2     mary   24     DA   40000
3     john   25     DS   35000

In [139]:
data.loc[data.age.isnull() == True]

Empty DataFrame
Columns: [Name, age, domain, salary]
Index: []

In [140]:
#data.age.isnull().sum()

0

In [141]:
# iloc
data.iloc[:,[0,1]]

      Name  age
1  Lakshmi   24
2     mary   24
3     john   25
4      ABC   27
5      XYZ   27

In [142]:
data.iloc[: , 0:2]

      Name  age
1  Lakshmi   24
2     mary   24
3     john   25
4      ABC   27
5      XYZ   27

In [143]:
data.iloc[: , 2:4]

  domain  salary
1    SME   30000
2     DA   40000
3     DS   35000
4     DE   45000
5     AI   50000

In [145]:
data.iloc[: , [0,3, 1]]

      Name  salary  age
1  Lakshmi   30000   24
2     mary   40000   24
3     john   35000   25
4      ABC   45000   27
5      XYZ   50000   27

In [146]:
data.iloc[[1,2] , :]

   Name  age domain  salary
2  mary   24     DA   40000
3  john   25     DS   35000

In [147]:
data.iloc[[1,2] , [1,2]]

   age domain
2   24     DA
3   25     DS

In [150]:
data1 = data.copy()

In [151]:
data1

      Name  age domain  salary
1  Lakshmi   24    SME   30000
2     mary   24     DA   40000
3     john   25     DS   35000
4      ABC   27     DE   45000
5      XYZ   27     AI   50000

In [165]:
l1 = [1,3,5]
l2 = [2,3,4]
pd.DataFrame((l1 )

SyntaxError: incomplete input (284076452.py, line 3)